feat: add mermaid
